GabeMx5/ESP32-C3-Semaphore/src/main.cpp
#define FIRMWARE_VERSION "1.2.9-halloween.1"

#include "teeSerial.h"
TeeSerial teeSerial;
#include <vector>
#include <set>
#include <esp_log.h>
#include <WiFi.h>
#include <ESPmDNS.h>
#include <esp_ota_ops.h>
#include <esp_task_wdt.h>
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include <ArduinoOTA.h>
#include "wifiConfigManager.h"
#include "ledController.h"
#include "networkManager.h"
#include "monitorController.h"
#include "mqttController.h"
#include "timerController.h"
#include "configController.h"
#include "geoController.h"
#include "otaController.h"
#include "serialConsole.h"
#include "alexaController.h"
#include "bambulabController.h"
#ifdef IMPROV_ENABLED
#include "improvController.h"
#endif

AsyncWebServer webServer(80);
AsyncWebSocket ws("/ws");
static std::set<uint32_t> _consoleViewerIds;  // client IDs currently on the console tab
static std::set<uint32_t> _infoViewerIds;     // client IDs currently on the info or settings tab
static std::set<uint32_t> _bambuViewerIds;    // client IDs currently on the bambu tab
WiFiConfigManager wifiManager;
LEDController ledController;
NetworkManager networkManager;
MonitorController monitorController;
MQTTController mqttController;
TimerController timerController;
ConfigController configController;
GeoController    geoController;
OTAController    otaController;
SerialConsole    serialConsole(wifiManager, mqttController, FIRMWARE_VERSION);
AlexaController  alexaController;
BambuLabController bambuController;

void weatherTempToRgb(float temp, uint8_t& outR, uint8_t& outG, uint8_t& outB);
void conditionToRgb(WeatherCondition cond, bool isDay, uint8_t& r, uint8_t& g, uint8_t& b);
void humidityToRgb(float humidity, uint8_t& r, uint8_t& g, uint8_t& b);
static void aqValueToRgb(float v, float tGood, float tModerate, float tPoor, uint8_t& r, uint8_t& g, uint8_t& b);

static const char* conditionToString(WeatherCondition c)
{
    switch (c) {
        case WeatherCondition::CLEAR:         return "Clear";
        case WeatherCondition::PARTLY_CLOUDY: return "Partly Cloudy";
        case WeatherCondition::FOGGY:         return "Foggy";
        case WeatherCondition::DRIZZLE:       return "Drizzle";
        case WeatherCondition::RAINY:         return "Rainy";
        case WeatherCondition::SNOWY:         return "Snowy";
        case WeatherCondition::STORMY:        return "Stormy";
        default:                              return "Unknown";
    }
}

// ─── Broadcast ────────────────────────────────────────────────────────────────

static String _buildLedStatus()
{
    JsonDocument doc;
    doc["type"] = "ledStatus";
    JsonArray leds = doc["leds"].to<JsonArray>();
    for (int i = 0; i < LED_COUNT; i++)
    {
        JsonObject led = leds.add<JsonObject>();
        uint32_t color = ledController.getLEDColor(i);
        led["r"]       = (color >> 16) & 0xFF;
        led["g"]       = (color >> 8) & 0xFF;
        led["b"]       = color & 0xFF;
        led["on"]      = ledController.getLEDOn(i);
        led["blink"]   = ledController.getLEDBlink(i);
    }
    String msg; serializeJson(doc, msg); return msg;
}

void sendLedStatus(AsyncWebSocketClient *client) { client->text(_buildLedStatus()); }

void broadcastLedStatus()
{
    String msg = _buildLedStatus();
    ws.textAll(msg);
    mqttController.publish(msg);
    for (int i = 0; i < LED_COUNT; i++)
    {
        uint32_t color = ledController.getLEDColor(i);
        mqttController.publishLedState(i,
            (color >> 16) & 0xFF,
            (color >> 8)  & 0xFF,
            color & 0xFF,
            ledController.getLEDOn(i));
    }
}

static String _buildCycleStatus()
{
    JsonDocument doc;
    doc["type"]          = "cycleStatus";
    doc["cycle"]         = ledController.getCycleEnabled();
    doc["topLedTime"]    = ledController.getTopLedTime();
    doc["middleLedTime"] = ledController.getMiddleLedTime();
    doc["bottomLedTime"] = ledController.getBottomLedTime();
    String msg; serializeJson(doc, msg); return msg;
}

void sendCycleStatus(AsyncWebSocketClient *client) { client->text(_buildCycleStatus()); }

void broadcastCycleStatus()
{
    String msg = _buildCycleStatus();
    ws.textAll(msg);
    mqttController.publish(msg);
    mqttController.publishSwitchState("cycle", ledController.getCycleEnabled());
}

static String _buildPartyStatus()
{
    JsonDocument doc;
    doc["type"]         = "partyStatus";
    doc["party"]        = ledController.getPartyEnabled();
    doc["partyMadness"] = ledController.getPartyMadness();
    String msg; serializeJson(doc, msg); return msg;
}

void sendPartyStatus(AsyncWebSocketClient *client) { client->text(_buildPartyStatus()); }

void broadcastPartyStatus()
{
    String msg = _buildPartyStatus();
    ws.textAll(msg);
    mqttController.publish(msg);
    mqttController.publishSwitchState("party", ledController.getPartyEnabled());
}

static String _buildRainbowStatus()
{
    JsonDocument doc;
    doc["type"]             = "rainbowStatus";
    doc["rainbow"]          = ledController.getRainbowEnabled();
    doc["rainbowCycleTime"] = ledController.getRainbowCycleTime();
    String msg; serializeJson(doc, msg); return msg;
}

void sendRainbowStatus(AsyncWebSocketClient *client) { client->text(_buildRainbowStatus()); }

void broadcastRainbowStatus()
{
    String msg = _buildRainbowStatus();
    ws.textAll(msg);
    mqttController.publish(msg);
    mqttController.publishSwitchState("rainbow", ledController.getRainbowEnabled());
}

static String _buildConfigStatus()
{
    JsonDocument doc;
    doc["type"]                  = "configStatus";
    doc["makeChangesPersistent"] = configController.getMakeChangesPersistent();
    doc["latitude"]              = configController.getLatitude();
    doc["longitude"]             = configController.getLongitude();
    String msg; serializeJson(doc, msg); return msg;
}

void sendConfigStatus(AsyncWebSocketClient *client) { client->text(_buildConfigStatus()); }

void broadcastConfigStatus()
{
    ws.textAll(_buildConfigStatus());
}

void sendMqttConfig(AsyncWebSocketClient *client)
{
    JsonDocument doc;
    doc["type"]      = "mqttConfig";
    doc["broker"]    = mqttController.getBroker();
    doc["port"]      = mqttController.getPort();
    doc["username"]  = mqttController.getUsername();
    doc["password"]  = mqttController.getPassword();
    doc["clientId"]  = mqttController.getClientId();
    doc["topic"]     = mqttController.getTopicPrefix();
    doc["enabled"]   = mqttController.getEnabled();
    doc["connected"] = mqttController.isConnected();
    String response;
    serializeJson(doc, response);
    client->text(response);
}

void sendBambuConfig(AsyncWebSocketClient *client)
{
    JsonDocument doc;
    doc["type"]           = "bambuConfig";
    doc["ip"]             = bambuController.getIp();
    doc["serial"]         = bambuController.getSerial();
    doc["accessCode"]     = bambuController.getAccessCode();
    doc["enabled"]        = bambuController.getEnabled();
    doc["connected"]      = bambuController.isConnected();
    doc["state"]          = BambuLabController::stateToString(bambuController.getState());
    doc["bambuMode"]      = bambuController.getBambuMode();
    doc["idleTimeoutMin"] = bambuController.getIdleTimeoutMin();
    bambuController.addStateColorsToJson(doc);
    String response;
    serializeJson(doc, response);
    client->text(response);
}

