GabeMx5/ESP32-C3-Semaphore/src/main.cpp
// BambuLab printer mode drives the LEDs through LEDController's overlay, which
// has a finite lifetime. Arming it for "practically forever" (the old 24 h
// value) meant the LEDs silently fell back to the saved configuration when the
// printer stayed in one state for a day. Instead it is armed for a short hold
// time and re-armed from loop() every refresh interval, so the LEDs also
// recover on their own if the refresh ever stops.
static const unsigned long BAMBU_OVERLAY_HOLD_MS    = 120000;  // 2 minutes
static const unsigned long BAMBU_OVERLAY_REFRESH_MS = 30000;   // 30 seconds

static void applyBambuLedState(BambuState s)
{
    uint8_t r0, g0, b0, r1, g1, b1, r2, g2, b2;
    bambuController.getStateColor(s, 0, r0, g0, b0);
    bambuController.getStateColor(s, 1, r1, g1, b1);
    bambuController.getStateColor(s, 2, r2, g2, b2);
    if (!r0 && !g0 && !b0 && !r1 && !g1 && !b1 && !r2 && !g2 && !b2)
        ledController.cancelOverlay();
    else
        ledController.showOverlay(r0, g0, b0, r1, g1, b1, r2, g2, b2, BAMBU_OVERLAY_HOLD_MS);
}

// True when the given printer state lights at least one LED. States that map to
// "all off" release the overlay instead of holding it, so there is nothing to
// re-arm for them and re-applying would restart the restore every refresh.
static bool bambuStateHasColor(BambuState s)
{
    uint8_t r, g, b;
    for (int led = 0; led < 3; led++)
    {
        bambuController.getStateColor(s, led, r, g, b);
        if (r || g || b) return true;
    }
    return false;
}

// Disables BambuLab printer mode and notifies all WS clients.
// Called whenever any other effect is activated.
static void cancelBambuMode()
{
    if (!bambuController.getBambuMode()) return;
    bambuController.setBambuMode(false);
    configController.setBambuMode(false);
    bambuController.resetIdle();
    ledController.cancelOverlay();
    JsonDocument doc;
    doc["type"]      = "bambuConfig";
    doc["bambuMode"] = false;
    String msg; serializeJson(doc, msg);
    ws.textAll(msg);
}

void sendWifiConfig(AsyncWebSocketClient *client)
{
    JsonDocument doc;
    doc["type"]       = "wifiConfig";
    doc["deviceName"] = wifiManager.deviceName;
    doc["ntpServer"]  = wifiManager.ntpServer;
    doc["timezone"]   = wifiManager.timezone;
    doc["ssid"]       = wifiManager.wifiSSID;
    doc["password"]   = wifiManager.wifiPassword;
    doc["dhcp"]       = wifiManager.dhcp;
    if (!wifiManager.dhcp)
    {
        doc["ip"]      = wifiManager.localIP.toString();
        doc["subnet"]  = wifiManager.subnet.toString();
        doc["gateway"] = wifiManager.gateway.toString();
        doc["dns"]     = wifiManager.dns.toString();
    }
    String response;
    serializeJson(doc, response);
    client->text(response);
}

// Dynamic fields — sent every second when client is on the info tab
void sendSysInfo(AsyncWebSocketClient *client)
{
    JsonDocument doc;
    doc["type"]          = "sysInfo";
    doc["rssi"]          = WiFi.RSSI();
    doc["freeHeap"]      = ESP.getFreeHeap();
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 0)) {
        char buf[32];
        strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &timeinfo);
        doc["datetime"] = buf;
    }
    doc["uptime"]         = millis() / 1000;
    doc["bambuConnected"] = bambuController.isConnected();
    // Surfaced so the page served in AP mode can say why the join failed
    // instead of leaving the user to guess.
    doc["wifiFailReason"] = networkManager.getLastFailReason();
    doc["wifiFailText"]   = networkManager.getLastFailText();
    doc["apMode"]         = networkManager.isAPMode();
    doc["mqttConnected"]  = mqttController.isConnected();
    String response;
    serializeJson(doc, response);
    client->text(response);
}

// Static fields — sent once at connect and when weather/AQ data updates
static String _buildSysInfoStatic()
{
    JsonDocument doc;
    doc["type"]         = "sysInfoStatic";
    doc["version"]      = FIRMWARE_VERSION;
    doc["ip"]           = WiFi.localIP().toString();
    doc["ssid"]         = WiFi.SSID();
    doc["mac"]          = WiFi.macAddress();
    doc["cpuFreq"]      = ESP.getCpuFreqMHz();
    doc["chipModel"]    = ESP.getChipModel();
    doc["chipRevision"] = ESP.getChipRevision();
    doc["wifiChannel"]  = WiFi.channel();
    doc["mqttBroker"]   = mqttController.getBroker();
    doc["latitude"]     = configController.getLatitude();
    doc["longitude"]    = configController.getLongitude();
    if (geoController.weather.valid) {
        doc["weatherCode"]      = geoController.weather.weatherCode;
        doc["weatherTemp"]      = geoController.weather.temperature;
        doc["weatherHumidity"]  = geoController.weather.humidity;
        doc["weatherCondition"] = (int)geoController.weather.condition;
        uint8_t wr, wg, wb;
        weatherTempToRgb(geoController.weather.temperature, wr, wg, wb);
        doc["temperatureR"] = wr; doc["temperatureG"] = wg; doc["temperatureB"] = wb;
        uint8_t cr, cg, cb;
        conditionToRgb(geoController.weather.condition, geoController.weather.isDay, cr, cg, cb);
        doc["conditionR"] = cr; doc["conditionG"] = cg; doc["conditionB"] = cb;
        uint8_t hr, hg, hb;
        humidityToRgb(geoController.weather.humidity, hr, hg, hb);
        doc["humidityR"] = hr; doc["humidityG"] = hg; doc["humidityB"] = hb;
    }
    if (geoController.airQuality.valid) {
        doc["aqPm25"] = geoController.airQuality.pm2_5;
        doc["aqPm10"] = geoController.airQuality.pm10;
        doc["aqNo2"]  = geoController.airQuality.no2;
        uint8_t aqr, aqg, aqb;
        aqValueToRgb(geoController.airQuality.pm2_5, 12,  35,  55,  aqr, aqg, aqb);
        doc["aqPm25R"] = aqr; doc["aqPm25G"] = aqg; doc["aqPm25B"] = aqb;
        aqValueToRgb(geoController.airQuality.pm10,  20,  40,  140, aqr, aqg, aqb);
        doc["aqPm10R"] = aqr; doc["aqPm10G"] = aqg; doc["aqPm10B"] = aqb;
        aqValueToRgb(geoController.airQuality.no2,   40,  100, 200, aqr, aqg, aqb);
        doc["aqNo2R"]  = aqr; doc["aqNo2G"]  = aqg; doc["aqNo2B"]  = aqb;
    }
    String msg; serializeJson(doc, msg); return msg;
}

void sendSysInfoStatic(AsyncWebSocketClient *client) { client->text(_buildSysInfoStatic()); }

void broadcastSysInfoStatic() { ws.textAll(_buildSysInfoStatic()); }

// Send a message to clients on the bambu or info tab only
static void _sendToBambuAndInfoViewers(const String& msg)
{
    for (uint32_t id : _bambuViewerIds) {
        AsyncWebSocketClient* c = ws.client(id);
        if (c) c->text(msg);
    }
    for (uint32_t id : _infoViewerIds) {
        AsyncWebSocketClient* c = ws.client(id);
        if (c) c->text(msg);
    }
}

// True when at least one client is on a tab that consumes these updates.
static bool _hasBambuOrInfoViewers()
{
    return !_bambuViewerIds.empty() || !_infoViewerIds.empty();
}

void weatherTempToRgb(float temp, uint8_t& outR, uint8_t& outG, uint8_t& outB)
{
    float t     = max(5.0f, min(30.0f, temp));
    float ratio = (t - 5.0f) / 25.0f;
    float hue   = 210.0f * (1.0f - ratio);
    float h = hue / 60.0f;
    float c = 1.0f;
    float x = c * (1.0f - fabsf(fmodf(h, 2.0f) - 1.0f));
    float r = 0, g = 0, b = 0;
    if      (h < 1) { r = c; g = x; }
    else if (h < 2) { r = x; g = c; }
    else if (h < 3) { g = c; b = x; }
    else if (h < 4) { g = x; b = c; }
    else if (h < 5) { r = x; b = c; }
    else            { r = c; b = x; }
    outR = (uint8_t)(r * 255);
    outG = (uint8_t)(g * 255);
    outB = (uint8_t)(b * 255);
}

void conditionToRgb(WeatherCondition cond, bool isDay, uint8_t& r, uint8_t& g, uint8_t& b)
{
    switch (cond) {
        case WeatherCondition::CLEAR:
            if (isDay) { r=255; g=200; b=0;   } // golden yellow
            else       { r=0;   g=20;  b=150; } // dark blue
            break;
        case WeatherCondition::PARTLY_CLOUDY: r=150; g=170; b=200; break; // steel blue
        case WeatherCondition::FOGGY:         r=160; g=160; b=160; break; // gray
        case WeatherCondition::DRIZZLE:       r=80;  g=140; b=255; break; // light blue
        case WeatherCondition::RAINY:         r=0;   g=60;  b=220; break; // blue
        case WeatherCondition::SNOWY:         r=200; g=240; b=255; break; // ice white
        case WeatherCondition::STORMY:        r=140; g=0;   b=200; break; // purple
        default:                              r=80;  g=80;  b=80;  break; // dim gray
    }
}

void humidityToRgb(float humidity, uint8_t& r, uint8_t& g, uint8_t& b)
{
    float h = max(0.0f, min(100.0f, humidity)) / 100.0f;
    // 0% = yellow (255,200,0), 50% = green (0,200,80), 100% = blue (0,60,220)
    if (h < 0.5f) {
        float t = h * 2.0f;
        r = (uint8_t)(255 * (1.0f - t));
        g = (uint8_t)(200 * (1.0f - t) + 200 * t);
        b = (uint8_t)(80  * t);
    } else {
        float t = (h - 0.5f) * 2.0f;
        r = 0;
        g = (uint8_t)(200 * (1.0f - t));
        b = (uint8_t)(80  * (1.0f - t) + 220 * t);
    }
}

// Maps a pollutant value to RGB using AQI-style thresholds:
// good→green, moderate→yellow, poor→orange, very poor→red, hazardous→purple
static void aqValueToRgb(float v, float tGood, float tModerate, float tPoor,
                          uint8_t& r, uint8_t& g, uint8_t& b)
{
    if (v < tGood)     { r=0;   g=200; b=0;   return; } // green
    if (v < tModerate) { r=220; g=220; b=0;   return; } // yellow
    if (v < tPoor)     { r=255; g=100; b=0;   return; } // orange
    if (v < tPoor*2)   { r=255; g=0;   b=0;   return; } // red
                         r=160; g=0;   b=160;            // purple
}

