GabeMx5/ESP32-C3-Semaphore/src/main.cpp
void applyAirQualityColor()
{
    if (!geoController.airQuality.valid) return;
    uint8_t r2, g2, b2; // top    — PM2.5  (thresholds: 12 / 35 / 55)
    uint8_t r1, g1, b1; // middle — PM10   (thresholds: 20 / 40 / 140)
    uint8_t r0, g0, b0; // bottom — NO₂    (thresholds: 40 / 100 / 200)
    aqValueToRgb(geoController.airQuality.pm2_5, 12,  35,  55,  r2, g2, b2);
    aqValueToRgb(geoController.airQuality.pm10,  20,  40,  140, r1, g1, b1);
    aqValueToRgb(geoController.airQuality.no2,   40,  100, 200, r0, g0, b0);
    ledController.showOverlay(r0, g0, b0, r1, g1, b1, r2, g2, b2);
}

void applyWeatherColor()
{
    if (!geoController.weather.valid) return;
    uint8_t r2, g2, b2; // top    — condition
    uint8_t r1, g1, b1; // middle — temperature
    uint8_t r0, g0, b0; // bottom — humidity
    conditionToRgb(geoController.weather.condition, geoController.weather.isDay, r2, g2, b2);
    weatherTempToRgb(geoController.weather.temperature, r1, g1, b1);
    humidityToRgb(geoController.weather.humidity, r0, g0, b0);
    ledController.showOverlay(r0, g0, b0, r1, g1, b1, r2, g2, b2);
}

// ─── Command processing (shared between WebSocket and MQTT) ──────────────────

void processCommand(JsonDocument &doc)
{
    const char *type = doc["type"];
    if (!type) return;

    if (strcmp(type, "setLed") == 0)
    {
        if (bambuController.getBambuMode() && bambuController.isConnected()) return;
        int      ledIndex = doc["led"];
        uint32_t existing = ledController.getLEDColor(ledIndex);
        int er = (existing >> 16) & 0xFF;
        int eg = (existing >> 8)  & 0xFF;
        int eb = existing & 0xFF;
        int red, green, blue;
        if (!doc["brightness"].isNull() && doc["r"].isNull())
        {
            int br   = doc["brightness"];
            int maxC = max({er, eg, eb});
            red   = maxC > 0 ? er * br / maxC : 0;
            green = maxC > 0 ? eg * br / maxC : 0;
            blue  = maxC > 0 ? eb * br / maxC : 0;
        }
        else
        {
            red   = doc["r"].isNull() ? er : (int)doc["r"];
            green = doc["g"].isNull() ? eg : (int)doc["g"];
            blue  = doc["b"].isNull() ? eb : (int)doc["b"];
        }
        bool on    = doc["on"]    | false;
        bool blink = doc["blink"] | false;
        monitorController.displayMessage("LED " + String(ledIndex) + ": \n" +
                                         "R:" + String(red) + "\n" +
                                         "G:" + String(green) + "\n" +
                                         "B:" + String(blue));
        ledController.setLED(ledIndex, red, green, blue, on, blink);
        configController.markDirty();
        broadcastLedStatus();
    }
    else if (strcmp(type, "getLed") == 0)
    {
        broadcastLedStatus();
    }
    else if (strcmp(type, "setWifi") == 0)
    {
        String newName     = doc["deviceName"] | wifiManager.deviceName.c_str();
        String newNtp      = doc["ntpServer"]  | wifiManager.ntpServer.c_str();
        String newTz       = doc["timezone"]   | wifiManager.timezone.c_str();
        String newSSID     = doc["ssid"]       | "";
        String newPassword = doc["password"]   | "";
        bool   dhcpMode    = doc["dhcp"]       | true;
        String ipStr      = doc["ip"]      | "";
        String subnetStr  = doc["subnet"]  | "";
        String gatewayStr = doc["gateway"] | "";
        String dnsStr     = doc["dns"]     | "";
        IPAddress localIP, subnet, gateway, dns;
        if (!dhcpMode &&
            (!localIP.fromString(ipStr) ||
             !subnet.fromString(subnetStr) ||
             !gateway.fromString(gatewayStr) ||
             !dns.fromString(dnsStr)))
        {
            mqttController.publish("{\"type\":\"status\",\"status\":\"error\",\"message\":\"Invalid IP\"}");
            return;
        }
        wifiManager.saveConfig(newName, newNtp, newTz, newSSID, newPassword, dhcpMode, localIP, subnet, gateway, dns);
        mqttController.publish("{\"type\":\"status\",\"status\":\"saved\",\"reboot\":true}");
        delay(1000);
        ESP.restart();
    }
    else if (strcmp(type, "startOTA") == 0)
    {
        xTaskCreate([](void*) {
            otaController.start();
            vTaskDelete(NULL);
        }, "ota", 8192, NULL, 1, NULL);
    }
    else if (strcmp(type, "getWifi") == 0)
    {
        JsonDocument resp;
        resp["type"]       = "wifiConfig";
        resp["deviceName"] = wifiManager.deviceName;
        resp["ntpServer"]  = wifiManager.ntpServer;
        resp["timezone"]   = wifiManager.timezone;
        resp["ssid"]       = wifiManager.wifiSSID;
        resp["password"]   = wifiManager.wifiPassword;
        resp["dhcp"]     = wifiManager.dhcp;
        if (!wifiManager.dhcp)
        {
            resp["ip"]      = wifiManager.localIP.toString();
            resp["subnet"]  = wifiManager.subnet.toString();
            resp["gateway"] = wifiManager.gateway.toString();
            resp["dns"]     = wifiManager.dns.toString();
        }
        String msg;
        serializeJson(resp, msg);
        mqttController.publish(msg);
    }
    else if (strcmp(type, "setCycle") == 0)
    {
        bool on = doc["cycle"] | false;
        if (on) cancelBambuMode();
        ledController.setCycle(
            on,
            doc["topLedTime"]    | ledController.getTopLedTime(),
            doc["middleLedTime"] | ledController.getMiddleLedTime(),
            doc["bottomLedTime"] | ledController.getBottomLedTime()
        );
        configController.markDirty();
        broadcastCycleStatus();
    }
    else if (strcmp(type, "setParty") == 0)
    {
        bool on = doc["party"] | false;
        if (on) cancelBambuMode();
        ledController.setParty(on, doc["partyMadness"] | -1);
        configController.markDirty();
        broadcastPartyStatus();
        broadcastCycleStatus();
        broadcastRainbowStatus();
    }
    else if (strcmp(type, "setRainbow") == 0)
    {
        bool on = doc["rainbow"] | false;
        if (on) cancelBambuMode();
        ledController.setRainbow(
            on,
            doc["rainbowCycleTime"] | ledController.getRainbowCycleTime()
        );
        configController.markDirty();
        broadcastRainbowStatus();
        broadcastCycleStatus();
        broadcastPartyStatus();
    }
    else if (strcmp(type, "randomYesNo") == 0)
    {
        cancelBambuMode();
        ledController.startRandomYesNo();
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    }
    else if (strcmp(type, "morse") == 0)
    {
        cancelBambuMode();
        ledController.startMorse(doc["text"] | "SOS");
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    }
    else if (strcmp(type, "setConfig") == 0)
    {
        configController.setMakeChangesPersistent(doc["makeChangesPersistent"] | true);
        broadcastConfigStatus();
    }
    else if (strcmp(type, "weatherColor") == 0)
    {
        cancelBambuMode();
        Serial.printf("[weatherColor] valid=%d temp=%.1f\n",
                      geoController.weather.valid, geoController.weather.temperature);
        applyWeatherColor();
    }
    else if (strcmp(type, "airQualityColor") == 0)
    {
        cancelBambuMode();
        Serial.printf("[airQualityColor] valid=%d pm2_5=%.1f\n",
                      geoController.airQuality.valid, geoController.airQuality.pm2_5);
        applyAirQualityColor();
    }
    else if (strcmp(type, "setLocation") == 0)
    {
        float lat = doc["latitude"]  | 0.0f;
        float lon = doc["longitude"] | 0.0f;
        configController.setLocation(lat, lon);
        geoController.setLocation(lat, lon);
        Serial.printf("[Geo] Location updated: %.6f, %.6f\n", lat, lon);
    }
    else if (strcmp(type, "getMqtt") == 0)
    {
        JsonDocument resp;
        resp["type"]      = "mqttConfig";
        resp["broker"]    = mqttController.getBroker();
        resp["port"]      = mqttController.getPort();
        resp["username"]  = mqttController.getUsername();
        resp["password"]  = mqttController.getPassword();
        resp["clientId"]  = mqttController.getClientId();
        resp["topic"]     = mqttController.getTopicPrefix();
        resp["enabled"]   = mqttController.getEnabled();
        resp["connected"] = mqttController.isConnected();
        String msg;
        serializeJson(resp, msg);
        mqttController.publish(msg);
    }
    else if (strcmp(type, "setMqtt") == 0)
    {
        mqttController.applyConfig(
            doc["broker"]   | "",
            doc["port"]     | 1883,
            doc["username"] | "",
            doc["password"] | "",
            doc["clientId"] | "semaphore",
            doc["topic"]    | "semaphore",
            doc["enabled"]  | false
        );
        mqttController.saveConfig();
        mqttController.publish("{\"type\":\"status\",\"status\":\"saved\",\"message\":\"MQTT config saved\"}");
    }
}

// ─── WebSocket ────────────────────────────────────────────────────────────────

