GabeMx5/ESP32-C3-Semaphore/src/main.cpp
void handleWebSocketMessage(AsyncWebSocketClient *client, uint8_t *data, size_t len)
{
    JsonDocument doc;
    if (deserializeJson(doc, data, len))
    {
        client->text("{\"type\":\"status\",\"status\":\"error\",\"message\":\"Invalid JSON\"}");
        return;
    }

    const char *type = doc["type"];


    if (strcmp(type, "startGuess") == 0)
    {
        cancelBambuMode();
        ledController.startGuess(doc["led"] | 0);
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
        return;
    }

    // setWifi needs client-specific response before restart
    if (strcmp(type, "setWifi") == 0)
    {
        String newName     = doc["deviceName"] | wifiManager.deviceName.c_str();
        String newNtp      = doc["ntpServer"]  | wifiManager.ntpServer.c_str();
        String newTz       = doc["timezone"]   | wifiManager.timezone.c_str();
        String newSSID     = doc["ssid"]       | "";
        String newPassword = doc["password"]   | "";
        bool   dhcpMode    = doc["dhcp"]       | true;
        String ipStr      = doc["ip"]      | "";
        String subnetStr  = doc["subnet"]  | "";
        String gatewayStr = doc["gateway"] | "";
        String dnsStr     = doc["dns"]     | "";
        IPAddress localIP, subnet, gateway, dns;
        if (!dhcpMode &&
            (!localIP.fromString(ipStr) ||
             !subnet.fromString(subnetStr) ||
             !gateway.fromString(gatewayStr) ||
             !dns.fromString(dnsStr)))
        {
            client->text("{\"type\":\"status\",\"status\":\"error\",\"message\":\"Invalid IP configuration\"}");
            return;
        }
        wifiManager.saveConfig(newName, newNtp, newTz, newSSID, newPassword, dhcpMode, localIP, subnet, gateway, dns);
        client->text("{\"type\":\"status\",\"status\":\"saved\",\"reboot\":true}");
        delay(1000);
        ESP.restart();
        return;
    }

    // getWifi needs client-specific response
    if (strcmp(type, "getWifi") == 0)
    {
        sendWifiConfig(client);
        return;
    }

    if (strcmp(type, "consoleOpen") == 0)
    {
        _consoleViewerIds.insert(client->id());
        return;
    }

    if (strcmp(type, "consoleClose") == 0)
    {
        _consoleViewerIds.erase(client->id());
        return;
    }

    if (strcmp(type, "infoOpen") == 0)
    {
        _infoViewerIds.insert(client->id());
        sendSysInfo(client);  // immediate push, don't wait for the 1 s tick
        return;
    }

    if (strcmp(type, "infoClose") == 0)
    {
        _infoViewerIds.erase(client->id());
        return;
    }

    if (strcmp(type, "bambuOpen") == 0)
    {
        _bambuViewerIds.insert(client->id());
        return;
    }

    if (strcmp(type, "bambuClose") == 0)
    {
        _bambuViewerIds.erase(client->id());
        return;
    }

    // getMqtt needs client-specific response
    if (strcmp(type, "getMqtt") == 0)
    {
        sendMqttConfig(client);
        return;
    }

    if (strcmp(type, "getBambu") == 0)
    {
        sendBambuConfig(client);
        return;
    }

    if (strcmp(type, "setBambu") == 0)
    {
        bambuController.applyConfig(
            doc["ip"]         | "",
            doc["serial"]     | "",
            doc["accessCode"] | "",
            doc["enabled"]    | false
        );
        bambuController.saveConfig();
        sendBambuConfig(client);
        return;
    }

    if (strcmp(type, "setBambuMode") == 0)
    {
        bool    mode    = doc["bambuMode"]      | false;
        uint8_t timeout = doc["idleTimeoutMin"] | (uint8_t)5;
        bambuController.setBambuMode(mode);
        bambuController.setIdleTimeoutMin(timeout);
        configController.setBambuMode(mode);
        configController.setIdleTimeoutMin(timeout);
        bambuController.resetIdle();
        if (mode) {
            ledController.setCycle(false, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
            ledController.setParty(false, ledController.getPartyMadness());
            ledController.setRainbow(false, ledController.getRainbowCycleTime());
            broadcastCycleStatus();
            broadcastPartyStatus();
            broadcastRainbowStatus();
            if (bambuController.isConnected()) {
                BambuState cur = bambuController.getState();
                applyBambuLedState(cur);
                if (cur == BambuState::IDLE || cur == BambuState::FINISH)
                    bambuController.markIdle();
            }
        } else {
            ledController.cancelOverlay();
        }
        {
            JsonDocument bdoc;
            bdoc["type"]      = "bambuConfig";
            bdoc["bambuMode"] = mode;
            String bmsg; serializeJson(bdoc, bmsg);
            ws.textAll(bmsg);
        }
        sendBambuConfig(client);
        return;
    }

    if (strcmp(type, "setBambuStateColor") == 0)
    {
        const char* stateName = doc["state"] | "";
        int     led = doc["led"] | -1;
        uint8_t r   = doc["r"]   | 0;
        uint8_t g   = doc["g"]   | 0;
        uint8_t b   = doc["b"]   | 0;
        if (led >= 0 && led <= 2) {
            BambuState s = BambuLabController::stateFromString(stateName);
            bambuController.setStateColor(s, led, r, g, b);
            bambuController.saveConfig();
            if (bambuController.getBambuMode() && bambuController.getState() == s)
                applyBambuLedState(s);
        }
        return;
    }

    // setMqtt needs client-specific response
    if (strcmp(type, "setMqtt") == 0)
    {
        mqttController.applyConfig(
            doc["broker"]   | "",
            doc["port"]     | 1883,
            doc["username"] | "",
            doc["password"] | "",
            doc["clientId"] | "semaphore",
            doc["topic"]    | "semaphore",
            doc["enabled"]  | false
        );
        mqttController.saveConfig();
        client->text("{\"type\":\"status\",\"status\":\"saved\",\"message\":\"MQTT config saved\"}");
        return;
    }

    // getTimers / setTimers need client-specific response
    if (strcmp(type, "getTimers") == 0)
    {
        timerController.sendTimers(client);
        return;
    }

    if (strcmp(type, "setTimers") == 0)
    {
        timerController.setTimers(doc["timers"].as<JsonArray>());
        client->text("{\"type\":\"status\",\"status\":\"saved\",\"message\":\"Timers saved\"}");
        return;
    }

    if (strcmp(type, "consoleCmd") == 0)
    {
        String cmd = doc["cmd"] | "";
        if (cmd.length() > 0)
            serialConsole.executeFromWeb(cmd);
        return;
    }

