GabeMx5/ESP32-C3-Semaphore/src/main.cpp
    processCommand(doc);
}

void onWebSocketEvent(AsyncWebSocket *server, AsyncWebSocketClient *client,
                      AwsEventType type, void *arg, uint8_t *data, size_t len)
{
    switch (type)
    {
        case WS_EVT_CONNECT:
            Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
            client->keepAlivePeriod(10);  // native WS ping frame every 10 s
            sendLedStatus(client);
            sendCycleStatus(client);
            sendPartyStatus(client);
            sendRainbowStatus(client);
            sendWifiConfig(client);
            sendMqttConfig(client);
            sendBambuConfig(client);
            timerController.sendTimers(client);
            sendConfigStatus(client);
            sendSysInfoStatic(client);
            break;
        case WS_EVT_DISCONNECT:
            Serial.printf("WebSocket client #%u disconnected from %s\n", client->id(), client->remoteIP().toString().c_str());
            _consoleViewerIds.erase(client->id());
            _infoViewerIds.erase(client->id());
            _bambuViewerIds.erase(client->id());
            break;
        case WS_EVT_DATA:
            handleWebSocketMessage(client, data, len);
            break;
        case WS_EVT_PONG:
        case WS_EVT_ERROR:
            break;
    }
}

// ─── MQTT ────────────────────────────────────────────────────────────────────

void onMQTTMessage(uint8_t *payload, unsigned int length)
{
    JsonDocument doc;
    if (deserializeJson(doc, payload, length))
    {
        mqttController.publish("{\"type\":\"status\",\"status\":\"error\",\"message\":\"Invalid JSON\"}");
        return;
    }
    processCommand(doc);
}

// ─── Web server ───────────────────────────────────────────────────────────────

void setupWebServer()
{
    ws.onEvent(onWebSocketEvent);
    webServer.addHandler(&ws);
    webServer.on("/ping", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(200, "text/plain", "pong");
    });

    static String cmdBody;
    webServer.on("/cmd", HTTP_POST,
        [](AsyncWebServerRequest *request) {
            JsonDocument doc;
            if (deserializeJson(doc, cmdBody)) { request->send(400, "text/plain", "invalid json"); return; }
            processCommand(doc);
            request->send(200, "text/plain", "ok");
        },
        nullptr,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
            if (index == 0) cmdBody = "";
            cmdBody += String((char*)data).substring(0, len);
        }
    );

    webServer.on("/backup", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;
        auto readFile = [&](const char* path, const char* key) {
            if (!LittleFS.exists(path)) return;
            File f = LittleFS.open(path, "r");
            if (!f) return;
            JsonDocument tmp;
            if (!deserializeJson(tmp, f)) doc[key] = tmp;
            f.close();
        };
        readFile("/config.json", "config");
        readFile("/wifi.json",   "wifi");
        readFile("/mqtt.json",   "mqtt");
        readFile("/timers.json", "timers");
        readFile("/bambu.json",  "bambu");
        String out;
        serializeJsonPretty(doc, out);
        AsyncWebServerResponse *resp = request->beginResponse(200, "application/json", out);
        resp->addHeader("Content-Disposition", "attachment; filename=\"semaphore-backup.json\"");
        request->send(resp);
    });

    static String restoreBody;
    webServer.on("/restore", HTTP_POST,
        [](AsyncWebServerRequest *request) {
            JsonDocument doc;
            if (deserializeJson(doc, restoreBody)) { request->send(400, "text/plain", "invalid json"); return; }
            auto writeFile = [&](const char* path, const char* key) {
                if (doc[key].isNull()) return;
                File f = LittleFS.open(path, "w");
                if (!f) return;
                serializeJsonPretty(doc[key], f);
                f.close();
            };
            writeFile("/config.json", "config");
            writeFile("/wifi.json",   "wifi");
            writeFile("/mqtt.json",   "mqtt");
            writeFile("/timers.json", "timers");
            writeFile("/bambu.json",  "bambu");
            Serial.println("[Backup] Restore completed.");
            request->send(200, "text/plain", "restore completed");
        },
        nullptr,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
            if (index == 0) restoreBody = "";
            restoreBody += String((char*)data).substring(0, len);
        }
    );

    webServer.on("/restart", HTTP_POST, [](AsyncWebServerRequest *request) {
        request->send(200, "text/plain", "restarting");
        delay(200);
        ESP.restart();
    });

    webServer.serveStatic("/", LittleFS, "/").setDefaultFile("index.html");
    webServer.begin();
    monitorController.displayMessage("IP:\n" + WiFi.localIP().toString());
}

// ─── Watchdog ─────────────────────────────────────────────────────────────────

#define WDT_TIMEOUT_S 60

// Arms the task watchdog on the Arduino loop task. If loop() ever stops feeding
// it — deadlock, corrupted state, a network call that never returns — the device
// panics and reboots instead of sitting there unresponsive until someone power
// cycles it. 60 s leaves room for the longest blocking call in loop()
// (PubSubClient's 15 s socket timeout).
static void setupWatchdog()
{
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t cfg = {};
    cfg.timeout_ms     = WDT_TIMEOUT_S * 1000;
    cfg.idle_core_mask = 0;
    cfg.trigger_panic  = true;
    // Arduino 3.x already initialises the TWDT at boot, so reconfigure it
    // instead of initialising a second time.
    if (esp_task_wdt_init(&cfg) == ESP_ERR_INVALID_STATE)
        esp_task_wdt_reconfigure(&cfg);
#else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
#endif
    esp_task_wdt_add(NULL);
    Serial.printf("[WDT] Task watchdog armed (%d s)\n", WDT_TIMEOUT_S);
}

// ─── Setup / Loop ─────────────────────────────────────────────────────────────

void setup()
{
    Serial.begin(115200);
    delay(200);
#ifdef IMPROV_ENABLED
    // Send before LittleFS (~600 ms from USB reset) so ImprovSerial detects
    // the device within its 1 s window. The guard in improvAnnounceAuthorized()
    // skips the packet if WiFi is already connected (NVS auto-connect), which
    // prevents regressing STATE_PROVISIONED to STATE_AUTHORIZED.
    improvAnnounceAuthorized();
#endif
    if (!LittleFS.begin(true))
    {
        Serial.println("LittleFS mount failed");
        return;
    }
#ifdef IMPROV_ENABLED
    if (!LittleFS.exists("/wifi.json"))
        runImprovSetup(FIRMWARE_VERSION);
#endif

