GabeMx5/ESP32-C3-Semaphore/src/main.cpp
    monitorController.begin();
    monitorController.displayMessage("Startup...");
    monitorController.displayMessage("Connecting to\nWiFi...");
    ledController.begin();
    configController.begin(ledController);
    timerController.begin();
    timerController.onAllOff = []() {
        if (bambuController.getBambuMode()) {
            bambuController.setBambuMode(false);
            configController.setBambuMode(false);
            bambuController.resetIdle();
            ledController.cancelOverlay();
            JsonDocument bdoc;
            bdoc["type"]      = "bambuConfig";
            bdoc["bambuMode"] = false;
            String bmsg; serializeJson(bdoc, bmsg);
            ws.textAll(bmsg);
        }
        for (int i = 0; i < LED_COUNT; i++) {
            uint32_t c = ledController.getLEDColor(i);
            ledController.setLED(i, (c>>16)&0xFF, (c>>8)&0xFF, c&0xFF, false, false);
        }
        ledController.setCycle(false, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
        ledController.setParty(false, ledController.getPartyMadness());
        ledController.setRainbow(false, ledController.getRainbowCycleTime());
        broadcastLedStatus();
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onLed = [](int idx, uint8_t r, uint8_t g, uint8_t b) {
        ledController.setCycle(false, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
        ledController.setParty(false, ledController.getPartyMadness());
        ledController.setRainbow(false, ledController.getRainbowCycleTime());
        ledController.setLED(idx, r, g, b, true, false);
        broadcastLedStatus();
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onCycle = [](bool on) {
        if (on) cancelBambuMode();
        ledController.setCycle(on, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
        if (on) {
            ledController.setParty(false, ledController.getPartyMadness());
            ledController.setRainbow(false, ledController.getRainbowCycleTime());
        }
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onParty = [](bool on) {
        if (on) cancelBambuMode();
        ledController.setParty(on, ledController.getPartyMadness());
        if (on) {
            ledController.setCycle(false, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
            ledController.setRainbow(false, ledController.getRainbowCycleTime());
        }
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onRainbow = [](bool on) {
        if (on) cancelBambuMode();
        ledController.setRainbow(on, ledController.getRainbowCycleTime());
        if (on) {
            ledController.setCycle(false, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
            ledController.setParty(false, ledController.getPartyMadness());
        }
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onWeatherColor = []() {
        cancelBambuMode();
        applyWeatherColor();
    };
    timerController.onBambuMode = [](bool on) {
        bambuController.setBambuMode(on);
        configController.setBambuMode(on);
        bambuController.resetIdle();
        if (on) {
            ledController.setCycle(false, ledController.getTopLedTime(), ledController.getMiddleLedTime(), ledController.getBottomLedTime());
            ledController.setParty(false, ledController.getPartyMadness());
            ledController.setRainbow(false, ledController.getRainbowCycleTime());
            broadcastCycleStatus();
            broadcastPartyStatus();
            broadcastRainbowStatus();
            if (bambuController.isConnected()) {
                BambuState cur = bambuController.getState();
                applyBambuLedState(cur);
                if (cur == BambuState::IDLE || cur == BambuState::FINISH)
                    bambuController.markIdle();
            }
        } else {
            ledController.cancelOverlay();
        }
        JsonDocument doc;
        doc["type"]      = "bambuConfig";
        doc["bambuMode"] = on;
        String msg; serializeJson(doc, msg);
        ws.textAll(msg);
    };
    timerController.onGuess = [](int led) {
        cancelBambuMode();
        ledController.startGuess(led);
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onMorse = [](const String& text) {
        cancelBambuMode();
        ledController.startMorse(text.c_str());
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    timerController.onRandomYesNo = []() {
        cancelBambuMode();
        ledController.startRandomYesNo();
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    ledController.onGuessResult = [](bool win, int led) {
        JsonDocument doc;
        doc["type"] = "guessResult";
        doc["win"]  = win;
        doc["led"]  = led;
        String msg;
        serializeJson(doc, msg);
        ws.textAll(msg);
        broadcastLedStatus();
    };
    networkManager.begin(wifiManager);
    geoController.begin(configController.getLatitude(), configController.getLongitude());
    geoController.onWeatherUpdate = []() {
        mqttController.publishWeather(
            geoController.weather.temperature,
            geoController.weather.humidity,
            conditionToString(geoController.weather.condition)
        );
        broadcastSysInfoStatic();
    };
    geoController.onAirQualityUpdate = []() {
        mqttController.publishAirQuality(
            geoController.airQuality.pm2_5,
            geoController.airQuality.pm10,
            geoController.airQuality.no2
        );
        broadcastSysInfoStatic();
    };
    configTzTime(wifiManager.timezone.c_str(), wifiManager.ntpServer.c_str());
    MDNS.begin(wifiManager.deviceName.c_str());
    alexaController.begin(webServer, ledController);
    alexaController.onChanged = []() {
        broadcastLedStatus();
        configController.markDirty();
    };
    setupWebServer();
    mqttController.connectedHandler = []()
    {
        broadcastLedStatus();
        broadcastCycleStatus();
        broadcastPartyStatus();
        broadcastRainbowStatus();
    };
    mqttController.begin(onMQTTMessage);
    ArduinoOTA
        .onStart([]() { Serial.println("OTA Start"); })
        .onEnd([]() { Serial.println("\nOTA End"); })
        .onProgress([](unsigned int progress, unsigned int total)
                    { Serial.printf("Progress: %u%%\r", (progress * 100) / total); })
        .onError([](ota_error_t error)
                 { Serial.printf("Error[%u]\n", error); });
    ArduinoOTA.begin();

