GabeMx5/ESP32-C3-Semaphore/src/main.cpp
    bambuController.loadConfig();
    bambuController.setBambuMode(configController.getBambuMode());
    bambuController.setIdleTimeoutMin(configController.getIdleTimeoutMin());
    bambuController.onStateChange = [](BambuState state) {
        JsonDocument doc;
        doc["type"]      = "bambuStatus";
        doc["state"]     = BambuLabController::stateToString(state);
        doc["connected"] = bambuController.isConnected();
        String msg;
        serializeJson(doc, msg);
        ws.textAll(msg);
        if (state == BambuState::IDLE || state == BambuState::FINISH) {
            bambuController.markIdle();
        } else {
            bambuController.resetIdle();
        }
        if (bambuController.getBambuMode()) {
            applyBambuLedState(state);
        }
    };
    bambuController.onIdleTimeout = []() {
        ledController.showColor(0, 0, 0, BAMBU_OVERLAY_HOLD_MS);
    };
    // Suppress low-level TLS error spam from the ESP32 core.
    // BambuLab occasionally sends large records; errors are handled by
    // our own reconnect logic and logged as "[BambuLab] connect failed".
    esp_log_level_set("ssl_client", ESP_LOG_NONE);
    bambuController.begin();
    serialConsole.setBambu(bambuController);
    serialConsole.setGeo(geoController);
    serialConsole.setNetwork(networkManager);

    serialConsole.begin();

    // Mark firmware as valid — cancels automatic rollback.
    // If setup() never reaches this point (crash, watchdog, panic),
    // the bootloader will revert to the previous firmware on next boot.
    esp_ota_mark_app_valid_cancel_rollback();
    Serial.println("[OTA] Firmware validated — rollback cancelled");

    otaController.onBeforeStart = []() {
        // Disconnect BambuLab and MQTT to free their TLS/TCP heap before OTA
        // opens its own HTTPS connections — prevents SSL memory allocation failures.
        bambuController.applyConfig("", "", "", false);
        mqttController.applyConfig("", 1883, "", "", "", "", false);
    };
    otaController.onStatus = [](const char* step) {
        JsonDocument doc;
        doc["type"] = "otaStatus";
        doc["step"] = step;
        String msg;
        serializeJson(doc, msg);
        ws.textAll(msg);
    };
    otaController.onProgress = [](const char* step, int pct) {
        JsonDocument doc;
        doc["type"] = "otaProgress";
        doc["step"] = step;
        doc["pct"]  = pct;
        String msg;
        serializeJson(doc, msg);
        ws.textAll(msg);
    };

    setupWatchdog();
}

void loop()
{
    esp_task_wdt_reset();
    ArduinoOTA.handle();
    alexaController.loop();
    networkManager.handleFallbackLogic();
    monitorController.loop();
    ledController.update();
    timerController.loop();
    ws.cleanupClients();
    if (!_consoleViewerIds.empty()) {
        String msg = teeSerial.drainOne();
        if (msg.length()) {
            for (uint32_t id : _consoleViewerIds) {
                AsyncWebSocketClient* c = ws.client(id);
                if (c) c->text(msg);
            }
        }
    }
    {
        static unsigned long _lastInfoPush = 0;
        if (!_infoViewerIds.empty() && millis() - _lastInfoPush >= 1000) {
            _lastInfoPush = millis();
            for (uint32_t id : _infoViewerIds) {
                AsyncWebSocketClient* c = ws.client(id);
                if (c) sendSysInfo(c);
            }
        }
    }
    {
        static bool _lastBambuConnected = false;
        bool nowConnected = bambuController.isConnected();
        if (nowConnected != _lastBambuConnected) {
            _lastBambuConnected = nowConnected;
            // Track the transition either way, but only build the message when
            // somebody is listening.
            if (_hasBambuOrInfoViewers()) {
                JsonDocument doc;
                doc["type"]      = "bambuConfig";
                doc["connected"] = nowConnected;
                if (!nowConnected) doc["state"] = "offline";
                String msg; serializeJson(doc, msg);
                _sendToBambuAndInfoViewers(msg);
            }
        }
    }
    {
        // Without the viewer check this allocated a JsonDocument and a String
        // every single second for nobody, fragmenting the heap over days.
        static unsigned long _lastIdlePush = 0;
        if (_hasBambuOrInfoViewers() && millis() - _lastIdlePush >= 1000) {
            _lastIdlePush = millis();
            int32_t idleSec = bambuController.getIdleSec();
            if (idleSec >= 0) {
                JsonDocument doc;
                doc["type"]    = "bambuConfig";
                doc["idleSec"] = idleSec;
                String msg; serializeJson(doc, msg);
                _sendToBambuAndInfoViewers(msg);
            }
        }
    }
    // Re-arm the BambuLab LED overlay: applyBambuLedState() only runs on a
    // state change, so a printer sitting in one state longer than the overlay
    // hold time would otherwise lose its colours.
    {
        static unsigned long _lastBambuOverlay = 0;
        if (bambuController.getBambuMode() && bambuController.isConnected() &&
            millis() - _lastBambuOverlay >= BAMBU_OVERLAY_REFRESH_MS) {
            _lastBambuOverlay = millis();
            if (bambuController.isIdleLedOff())
                ledController.showColor(0, 0, 0, BAMBU_OVERLAY_HOLD_MS);
            else if (bambuStateHasColor(bambuController.getState()))
                applyBambuLedState(bambuController.getState());
        }
    }
    mqttController.loop();
    configController.loop();
    geoController.loop();
    serialConsole.loop();
    bambuController.loop();
}
